package qin.goods7.doSave;

import org.junit.Test;

import java.util.Date;

@SuppressWarnings("all")
public class SaveGoods1 extends SaveGoods
{
    private Long a = 10l;

    @Test
    public void prints()
    {
        String s1 = "";

        for (int i = 0; i < 20; i++)
        {
            System.out.println("String s" + i + " = \"\";");
        }
    }

    /**
     * 手机/运营商/数码
     */
    @Test
    public void save()
    {
        String s0 = "荣耀8 4GB+32GB 全网通4G手机 魅海蓝\n" +
                  "主体\n" +
                  "品牌\n" +
                  "华为（HUAWEI）\n" +
                  "型号\n" +
                  "荣耀8（FRD-AL00）\n" +
                  "入网型号\n" +
                  "FRD-AL00\n" +
                  "上市年份\n" +
                  "2016年\n" +
                  "上市月份\n" +
                  "7月\n" +
                  "基本信息\n" +
                  "机身颜色\n" +
                  "魅海蓝\n" +
                  "机身长度（mm）\n" +
                  "145.5 mm\n" +
                  "机身宽度（mm）\n" +
                  "71.0 mm\n" +
                  "机身厚度（mm）\n" +
                  "7.45 mm\n" +
                  "机身重量（g）\n" +
                  "约153g（含电池）\n" +
                  "运营商标志或内容\n" +
                  "其他\n" +
                  "机身材质分类\n" +
                  "其他\n" +
                  "操作系统\n" +
                  "操作系统\n" +
                  "Android\n" +
                  "操作系统版本\n" +
                  "Android 6.0\n" +
                  "主芯片\n" +
                  "CPU品牌\n" +
                  "海思（Hisilicon）\n" +
                  "CPU频率\n" +
                  "4*Cortex A72 2.3GHz + 4*Cortex A53 1.8GHz + 微智核I5\n" +
                  "CPU核数\n" +
                  "八核\n" +
                  "CPU型号\n" +
                  "麒麟950\n" +
                  "GPU型号\n" +
                  "Mali T880\n" +
                  "网络支持\n" +
                  "双卡机类型\n" +
                  "双卡双待双通\n" +
                  "最大支持SIM卡数量\n" +
                  "2个\n" +
                  "SIM卡类型\n" +
                  "其他\n" +
                  "4G网络\n" +
                  "4G：移动（TD-LTE)；4G：联通(FDD-LTE)；4G：电信(FDD-LTE)\n" +
                  "3G/2G网络\n" +
                  "3G：移动(TD-SCDMA)；3G：联通(WCDMA)；3G：电信(CDMA2000)；2G：移动（GSM）+联通(GSM)\n" +
                  "网络频率（4G）\n" +
                  "主卡：TDD-LTE：B38/B39/B40/B41（2555MHz~2655MHz）；FDD-LTE：B1/B3/B4/B7；TD-SCDMA：B34/B39；WCDMA：B1/B2/B4/B5/B8；CDMA 1X&EVDO BC0；GSM：850/900/1800/1900MHz；副卡：GSM：850/900/1800/1900MHz\n" +
                  "网络频率（2G/3G）\n" +
                  "2G：GSM 850/900/1800/1900\n" +
                  "数据业务\n" +
                  "TDD-LTE/FDD-LTE/TD-SCDMA/WCDMA/HSPA+/DC-HSDPA/CDMA2000/CDMA1X/EDGE/GPRS；FDD-LTE：Cat4/Cat6；TDD-LTE：Cat4/Cat6\n" +
                  "其他\n" +
                  "不能同时支持两张CDMA卡* 各个地区的网络和频段可能有所不同，具体取决于当地运营商以及您所在的位置\n" +
                  "存储\n" +
                  "ROM\n" +
                  "32GB\n" +
                  "RAM\n" +
                  "4GB\n" +
                  "存储卡\n" +
                  "支持MicroSD（TF）\n" +
                  "最大存储扩展容量\n" +
                  "128GB\n" +
                  "可用空间\n" +
                  "备注：可使用的内存容量小于此值，因为手机软件占用的空间\n" +
                  "屏幕\n" +
                  "主屏幕尺寸（英寸）\n" +
                  "5.2英寸\n" +
                  "分辨率\n" +
                  "1920*1080(FHD)\n" +
                  "屏幕像素密度（ppi）\n" +
                  "423\n" +
                  "屏幕材质类型\n" +
                  "LTPS\n" +
                  "前置摄像头\n" +
                  "前置摄像头\n" +
                  "800万像素\n" +
                  "前摄光圈大小\n" +
                  "其他\n" +
                  "后置摄像头\n" +
                  "摄像头数量\n" +
                  "2个\n" +
                  "后置摄像头\n" +
                  "双1200万像素\n" +
                  "拍照特点\n" +
                  "数码变焦\n" +
                  "电池信息\n" +
                  "电池容量（mAh）\n" +
                  "3000mAh（典型值），2900mAh（额定值）\n" +
                  "电池是否可拆卸\n" +
                  "否\n" +
                  "充电器\n" +
                  "其他\n" +
                  "数据接口\n" +
                  "数据传输接口\n" +
                  "红外；WIFI；NFC；蓝牙；WiFi热点；OTG接口\n" +
                  "NFC/NFC模式\n" +
                  "支持（点对点模式）\n" +
                  "耳机接口类型\n" +
                  "3.5mm\n" +
                  "充电接口类型\n" +
                  "Type-C\n" +
                  "手机特性\n" +
                  "指纹识别\n" +
                  "支持\n" +
                  "GPS\n" +
                  "其他\n" +
                  "陀螺仪\n" +
                  "支持\n" +
                  "辅助功能\n" +
                  "常用功能\n" +
                  "录音\n" +
                  "包装清单\n" +
                  "手机X1；充电器X1；Type-C USB 线X1；快速指南X1；售后服务手册X1；取卡针X1；";
        String s1 = "小米 红米 3S 高配全网通 3GB内存 32GB ROM 经典金色 移动联通电信4G手机 双卡双待\n" +
                  "主体\n" +
                  "品牌\n" +
                  "小米（MI）\n" +
                  "型号\n" +
                  "红米 3S\n" +
                  "入网型号\n" +
                  "-\n" +
                  "上市年份\n" +
                  "2016年\n" +
                  "上市月份\n" +
                  "6月\n" +
                  "基本信息\n" +
                  "机身颜色\n" +
                  "金色\n" +
                  "机身长度（mm）\n" +
                  "139.3\n" +
                  "机身宽度（mm）\n" +
                  "69.6\n" +
                  "机身厚度（mm）\n" +
                  "8.5\n" +
                  "机身重量（g）\n" +
                  "144\n" +
                  "输入方式\n" +
                  "触控\n" +
                  "运营商标志或内容\n" +
                  "其他\n" +
                  "机身材质分类\n" +
                  "其他\n" +
                  "操作系统\n" +
                  "操作系统\n" +
                  "其他\n" +
                  "操作系统版本\n" +
                  "MIUI\n" +
                  "主芯片\n" +
                  "CPU品牌\n" +
                  "骁龙（Snapdragon)\n" +
                  "CPU频率\n" +
                  "4x1.4GHz+4x1.1GHz\n" +
                  "CPU核数\n" +
                  "八核\n" +
                  "CPU型号\n" +
                  "骁龙430（MSM8937）\n" +
                  "网络支持\n" +
                  "双卡机类型\n" +
                  "双卡双待单通\n" +
                  "最大支持SIM卡数量\n" +
                  "2个\n" +
                  "SIM卡类型\n" +
                  "Micro SIM\n" +
                  "4G网络\n" +
                  "4G：移动（TD-LTE)；4G：联通(FDD-LTE)；4G：电信(FDD-LTE)；4G：联通(TD-LTE)\n" +
                  "3G/2G网络\n" +
                  "3G：移动(TD-SCDMA)；3G：联通(WCDMA)；3G：电信(CDMA2000)；2G：移动（GSM）+联通(GSM)；2G：电信(CDMA)；2G：移动联通(GSM)+电信(CDMA)\n" +
                  "副SIM卡类型\n" +
                  "Nano SIM\n" +
                  "副SIM卡3G/2G网络\n" +
                  "不支持主副卡同时使用电信卡\n" +
                  "网络频率（2G/3G）\n" +
                  "2G：GSM 850/900/1800/1900；2G：CDMA 800；3G：TD-SCDMA 1900/2000；3G：WCDMA 850/900/1900/2100；3G：CDMA2000\n" +
                  "存储\n" +
                  "ROM\n" +
                  "32GB\n" +
                  "RAM\n" +
                  "3GB\n" +
                  "存储卡\n" +
                  "支持MicroSD（TF）\n" +
                  "最大存储扩展容量\n" +
                  "128GB\n" +
                  "屏幕\n" +
                  "主屏幕尺寸（英寸）\n" +
                  "5.0英寸\n" +
                  "分辨率\n" +
                  "1280×720（HD）\n" +
                  "屏幕材质类型\n" +
                  "其他\n" +
                  "前置摄像头\n" +
                  "前置摄像头\n" +
                  "500万像素\n" +
                  "前摄光圈大小\n" +
                  "其他\n" +
                  "后置摄像头\n" +
                  "摄像头数量\n" +
                  "1个\n" +
                  "后置摄像头\n" +
                  "1300万像素\n" +
                  "电池信息\n" +
                  "电池容量（mAh）\n" +
                  "4000mAh / 4100mAh(typ)\n" +
                  "电池是否可拆卸\n" +
                  "否\n" +
                  "充电器\n" +
                  "5V/2A\n" +
                  "闪充\n" +
                  "支持\n" +
                  "数据接口\n" +
                  "数据传输接口\n" +
                  "WIFI\n" +
                  "NFC/NFC模式\n" +
                  "其他\n" +
                  "耳机接口类型\n" +
                  "3.5mm\n" +
                  "充电接口类型\n" +
                  "Micro USB\n" +
                  "手机特性\n" +
                  "指纹识别\n" +
                  "支持\n" +
                  "GPS\n" +
                  "支持\n" +
                  "电子罗盘\n" +
                  "支持\n" +
                  "陀螺仪\n" +
                  "支持\n" +
                  "红外遥控\n" +
                  "支持\n" +
                  "其他\n" +
                  "距离感应；光线感应\n" +
                  "辅助功能\n" +
                  "常用功能\n" +
                  "其他\n" +
                  "包装清单\n" +
                  "手机主机*1 电源适配器*1 数据线*1";
        String s2 = "Apple iPhone 7 Plus (A1661) 128G 亮黑色 移动联通电信4G手机\n" +
                  "主体\n" +
                  "品牌\n" +
                  "苹果（Apple）\n" +
                  "型号\n" +
                  "iPhone 7 Plus\n" +
                  "入网型号\n" +
                  "A1661\n" +
                  "上市年份\n" +
                  "2016年\n" +
                  "上市月份\n" +
                  "9月\n" +
                  "基本信息\n" +
                  "机身颜色\n" +
                  "亮黑色\n" +
                  "机身长度（mm）\n" +
                  "158.2\n" +
                  "机身宽度（mm）\n" +
                  "77.9\n" +
                  "机身厚度（mm）\n" +
                  "7.3\n" +
                  "机身重量（g）\n" +
                  "188\n" +
                  "运营商标志或内容\n" +
                  "其他\n" +
                  "机身材质分类\n" +
                  "其他\n" +
                  "操作系统\n" +
                  "操作系统\n" +
                  "以官网信息为准\n" +
                  "主芯片\n" +
                  "CPU品牌\n" +
                  "以官网信息为准\n" +
                  "CPU频率\n" +
                  "以官网信息为准\n" +
                  "CPU核数\n" +
                  "其他\n" +
                  "CPU型号\n" +
                  "A10\n" +
                  "网络支持\n" +
                  "双卡机类型\n" +
                  "单卡\n" +
                  "最大支持SIM卡数量\n" +
                  "1个\n" +
                  "SIM卡类型\n" +
                  "Nano SIM\n" +
                  "4G网络\n" +
                  "4G：移动（TD-LTE)；4G：联通(TD-LTE)；4G：电信(FDD-LTE)\n" +
                  "3G/2G网络\n" +
                  "--\n" +
                  "网络频率（2G/3G）\n" +
                  "--\n" +
                  "存储\n" +
                  "ROM\n" +
                  "128GB\n" +
                  "RAM\n" +
                  "其他\n" +
                  "存储卡\n" +
                  "不支持\n" +
                  "可用空间\n" +
                  "（因算法不同，手机显示总容量可能小于机身容量，另，实际可供使用的空间小于手机显示总容量，并会因许多因素而可能有所差异，主要由系统占用导致）\n" +
                  "屏幕\n" +
                  "主屏幕尺寸（英寸）\n" +
                  "5.5英寸\n" +
                  "分辨率\n" +
                  "1920*1080(FHD)\n" +
                  "屏幕材质类型\n" +
                  "其他\n" +
                  "前置摄像头\n" +
                  "前置摄像头\n" +
                  "700万像素\n" +
                  "前摄光圈大小\n" +
                  "f/2.2\n" +
                  "后置摄像头\n" +
                  "摄像头数量\n" +
                  "2个\n" +
                  "后置摄像头\n" +
                  "双1200万像素\n" +
                  "电池信息\n" +
                  "电池容量（mAh）\n" +
                  "以官网信息为准\n" +
                  "电池是否可拆卸\n" +
                  "否\n" +
                  "充电器\n" +
                  "其他\n" +
                  "数据接口\n" +
                  "数据传输接口\n" +
                  "WIFI；WiFi热点；蓝牙\n" +
                  "NFC/NFC模式\n" +
                  "其他\n" +
                  "耳机接口类型\n" +
                  "lighting\n" +
                  "充电接口类型\n" +
                  "Lightning(iphone)\n" +
                  "手机特性\n" +
                  "指纹识别\n" +
                  "支持\n" +
                  "GPS\n" +
                  "支持\n" +
                  "陀螺仪\n" +
                  "支持\n" +
                  "辅助功能\n" +
                  "常用功能\n" +
                  "其他\n" +
                  "其他\n" +
                  "所有产品信息，以苹果官网为准（apple.com.cn)\n" +
                  "其他特性\n" +
                  "iPhone 7 和 iPhone 7 Plus 可防溅、抗水、防尘，在受控实验室条件下经测试，其效果在 IEC 60529 标准下达到 IP67 级别。防溅、抗水、防尘功能并非永久有效\n" +
                  "其他1\n" +
                  "防护性能可能会因日常磨损而下降。请勿为潮湿状态下的 iPhone 充电；请参阅使用手册了解清洁和干燥说明。由于浸入液体而导致的损坏不在保修范围之内。\n" +
                  "其他2\n" +
                  "亮黑色 iPhone7 和 iPhone7Plus 高光泽度的外观，采用包含九道精密工序的阳极氧化与抛光工艺打造而成。其表面硬度与其他采用阳极氧化处理的 Apple 产品相同\n" +
                  "其他3\n" +
                  "但是，高光泽度表面可能随着日常使用而出现细微磨损。如果对此有所担心，建议你选择一款合适的保护壳来保护你的 iPhone。\n" +
                  "其他4\n" +
                  "Apple Pay 仅在部分市场提供。请到苹果官网查看 Apple Pay 适用的国家和地区列表。\n" +
                  "其他5\n" +
                  "所有电池性能信息取决于网络设置和许多其它因素，实际结果可能有所不同。电池充电周期次数有限，最终可能需由 Apple 服务提供商更换。\n" +
                  "其他6\n" +
                  "电池使用时间和充电周期次数依设置和使用情况的不同而可能有所差异。详情请参阅www.apple.com/cn/batteries和www.apple.com/cn/iphone/battery.html。\n" +
                  "其他7\n" +
                  "需要使用数据计划。4G LTE Advanced 和 4G LTE 功能适用于特定国家或地区的特定运营商。速度依据理论上的数据吞吐量，并基于现场状况和不同运营商而可能有所差异\n" +
                  "其他8\n" +
                  "有关 4G LTE 支持的详情，请联系你的运营商并查看 www.apple.com/iphone/LTE。\n" +
                  "其他9\n" +
                  "亮黑色的 iPhone 7 和 iPhone 7 Plus 仅提供 128GB 和 256GB 机型。实际可供使用的空间小于总容量，并会因许多因素而可能有所差异。某些功能仅适用于部分国家或地区。烦请到苹果官网查看详情\n" +
                  "包装清单\n" +
                  "装有 iOS 10 的 iPhone*1，采用 Lightning 接头的 EarPods*1，Lightning 至 3.5 毫米耳机插孔转换器*1，Lightning 至 USB 连接线*1，USB 电源适配器*1，资料*1.";
        String s3 = "OPPO R9s Plus 6GB+64GB内存版 全网通4G手机 双卡双待 玫瑰金\n" +
                  "主体\n" +
                  "品牌\n" +
                  "OPPO\n" +
                  "型号\n" +
                  "R9s Plus\n" +
                  "入网型号\n" +
                  "R9s Plus\n" +
                  "上市年份\n" +
                  "2016年\n" +
                  "上市月份\n" +
                  "12月\n" +
                  "基本信息\n" +
                  "机身颜色\n" +
                  "玫瑰金\n" +
                  "机身长度（mm）\n" +
                  "163.63\n" +
                  "机身宽度（mm）\n" +
                  "80.8\n" +
                  "机身厚度（mm）\n" +
                  "7.35\n" +
                  "机身重量（g）\n" +
                  "约185g\n" +
                  "运营商标志或内容\n" +
                  "无\n" +
                  "机身材质分类\n" +
                  "金属后盖\n" +
                  "操作系统\n" +
                  "操作系统\n" +
                  "Android\n" +
                  "操作系统版本\n" +
                  "基于Android 6.0开发的ColorOS 3.0\n" +
                  "主芯片\n" +
                  "CPU品牌\n" +
                  "骁龙（Snapdragon)\n" +
                  "CPU频率\n" +
                  "1.95GHz\n" +
                  "CPU核数\n" +
                  "八核\n" +
                  "CPU型号\n" +
                  "骁龙653（MSM8976 Pro）\n" +
                  "网络支持\n" +
                  "双卡机类型\n" +
                  "双卡双待单通\n" +
                  "最大支持SIM卡数量\n" +
                  "2个\n" +
                  "SIM卡类型\n" +
                  "Nano SIM\n" +
                  "4G网络\n" +
                  "4G：移动（TD-LTE)；4G：电信(FDD-LTE)；4G：联通(TD-LTE)\n" +
                  "3G/2G网络\n" +
                  "3G：电信(CDMA2000)；2G：移动（GSM）+联通(GSM)；2G：电信(CDMA)\n" +
                  "副SIM卡类型\n" +
                  "Nano SIM；副SIM卡与存储卡二选一\n" +
                  "副SIM卡3G/2G网络\n" +
                  "2G：移动（GSM）+联通(GSM)；2G：电信(CDMA)\n" +
                  "网络频率（2G/3G）\n" +
                  "2G：GSM 850/900/1800/1900；2G：CDMA 800；3G：WCDMA：850/900/1700/1900/2100MHz\n" +
                  "存储\n" +
                  "ROM\n" +
                  "64GB\n" +
                  "RAM\n" +
                  "6GB\n" +
                  "存储卡\n" +
                  "支持MicroSD（TF）\n" +
                  "屏幕\n" +
                  "主屏幕尺寸（英寸）\n" +
                  "6.0英寸\n" +
                  "分辨率\n" +
                  "1920*1080(FHD)\n" +
                  "屏幕材质类型\n" +
                  "IPS\n" +
                  "前置摄像头\n" +
                  "前置摄像头\n" +
                  "1600万像素\n" +
                  "前摄光圈大小\n" +
                  "其他\n" +
                  "后置摄像头\n" +
                  "摄像头数量\n" +
                  "1个\n" +
                  "后置摄像头\n" +
                  "1600万像素\n" +
                  "电池信息\n" +
                  "电池容量（mAh）\n" +
                  "4000mAh（典型值）\n" +
                  "电池是否可拆卸\n" +
                  "否\n" +
                  "充电器\n" +
                  "5V/4A\n" +
                  "数据接口\n" +
                  "数据传输接口\n" +
                  "WIFI；OTG接口\n" +
                  "NFC/NFC模式\n" +
                  "不支持\n" +
                  "耳机接口类型\n" +
                  "3.5mm\n" +
                  "充电接口类型\n" +
                  "Micro USB\n" +
                  "手机特性\n" +
                  "指纹识别\n" +
                  "支持\n" +
                  "GPS\n" +
                  "支持\n" +
                  "陀螺仪\n" +
                  "支持\n" +
                  "辅助功能\n" +
                  "常用功能\n" +
                  "录音；手势识别；便签\n" +
                  "包装清单\n" +
                  "主机x1、耳机x1、数据线x1、充电器x1、SIM卡通针x1、保护套x1、产品信息手册及保修卡x1";
        String s4 = "苹果 iPhone7 手机壳 iPhone7/7 plus 手机壳 手机配件 驰红色iPhone7 plus适用\n" +
                  "商品名称：苹果 iPhone7 手机壳 iPhone7/7 plus 手机壳 手机配件 驰红色iPhone7 plus适用商品编号：1961989128店铺： Kyushu Star专营店商品毛重：10.00g材质：其他热门机型：其他风格：简约选购热点：其他款式：定制";
        String s5 = "普利邦(pulibang) 手机钢化膜纤薄3D高清防爆全屏膜 适用于iPhone7plus 5.5寸苹果i7plus 深邃黑\n" +
                  "品牌： 普利邦（pulibang） ♥关注\n" +
                  "商品名称：普利邦(pulibang) 手机钢化膜纤薄3D高清防爆全屏膜 适用于iPhone7plus 5.5寸苹果i7plus 深邃黑商品编号：10679135663店铺： 普利邦旗舰店商品毛重：50.00g货号：0914-苹果膜全屏材质：钢化玻璃热门机型：iPhone7/7 Plus类型：前膜特点：3D膜";
        String s6 = "华为（HUAWEI）P9plus原装数据线Type-C荣耀8荣耀v8 mate9手机充电线 (京东配送)华为原装Type-C数据线\n" +
                  "品牌： 华为（HUAWEI） ♥关注\n" +
                  "商品名称：华为（HUAWEI）P9plus原装数据线Type-C荣耀8荣耀v8 mate9手机充电线 (京东配送)华为原装Type-C数据线商品编号：10274802710店铺： 千百回数码专营店商品毛重：100.00g长度：1米特点：快充类型：Type-C";
        String s7 = "苹果原装数据线iPhone6s/6Plus/5SE/iPadpro/手机USB线充电数据线\n" +
                  "商品名称：苹果原装数据线iPhone6s/6Plus/5SE/iPadpro/手机USB线充电数据线商品编号：1963444329店铺： HK数码国际全球购专营店商品毛重：500.00g长度：1米特点：自动断电类型：苹果\n";
        String s8 = "魅族mx5原装充电器 mx3 mx4 pro5 魅蓝note2手机数据线 2A快速直充头 魅族原厂(简装)---单数据线1米\n" +
                  "商品名称：魅族mx5原装充电器 mx3 mx4 pro5 魅蓝note2手机数据线 2A快速直充头 魅族原厂(简装)---单数据线1米商品编号：10379486018店铺： 特比数码专营店商品毛重：60.00g长度：1米特点：快充类型：安卓";
        String s9 = "索尼（SONY） DSC-RX100 黑卡数码相机 2020万有效像素 等效28-100mm F1.8-F4.9蔡司镜头 1080P视频\n" +
                  "商品名称：索尼RX100商品编号：676676商品毛重：0.54kg商品产地：中国无锡分类：准专业机液晶屏尺寸：3.0英寸";
        String s10 = "";
        String s11 = "";
        String s12 = "";
        String s13 = "";
        String s14 = "";
        String s15 = "";
        String s16 = "";
        String s17 = "";
        String s18 = "";
        String s19 = "";

        makeSave
                  (
                            //name
                            new String[]
                                      {
                                                "华为荣耀手机", "小米手机", "苹果手机", "oppo手机", "iphone手机壳", "iphone手机贴膜",
                                                "华为数据线", "苹果数据线", "魅族数据线", "索尼数码摄像机"
                                      },
                            //details
                            new String[]
                                      {
                                                s0, s1, s2, s3, s4, s5, s6, s7, s8, s9
                                      },
                            //addDate
                            new Date[]
                                      {
                                                getDate(2010, 1, 1), getDate(2013, 3, 3),
                                                getDate(2014, 3, 4), getDate(2016, 11, 5),
                                                getDate(2009, 2, 2), getDate(2015, 5, 5),
                                                getDate(2013, 3, 3), getDate(2016, 6, 6),
                                                getDate(2016, 5, 6), getDate(2016, 8, 8)
                                      },
                            //levelId
                            new Integer[]
                                      {
                                                1, 1, 1, 1, 1, 1, 1, 1, 1, 1
                                      },
                            //price
                            new Double[]
                                      {
                                                2299.00d, 899.00d, 7188.88d, 3499.93d, 129.00d, 598.00d, 25.90d, 78.01d, 8.91d, 2399.01d
                                      },
                            //amount
                            new Long[]
                                      {
                                                a, a, a, a, a, a, a, a, a, a
                                      },
                            //goodsType
                            new String[]
                                      {
                                                "手机", "手机", "手机", "手机", "手机壳", "贴膜", "数据线", "数据线", "数据线", "数码相机"
                                      }
                  );
    }
}
















